In [1]:
############### Load Data #################
# Download the data files from our class room, then go to your working directory and paste them

In [2]:
import pandas as pd
import numpy as np

In [3]:
### csv files
# A Comma-Separated-Value file . 
# a delimited text file that holds tabular data as plain text.

In [4]:
df = pd.read_csv('Data\purchases.csv')
# when working with data comes from out sources, this data comes with its named features which we use for data processing
# so, you may neglect the index column
#df = pd.read_csv('Data\purchases.csv', index_col=0)
df

     Name  apples  oranges
0    June       3        0
1  Robert       2        3
2    Lily       0        7
3   David       1        2

In [5]:
### json files
# JavaScript Object Notation 
# a dictionary style like file (i.e. it is not a dictionary, but shares the same structure of (key:value) pair)

In [6]:
df = pd.read_json('Data\purchases.json')
df

        apples  oranges
David        1        2
June         3        0
Lily         0        7
Robert       2        3

In [7]:
### db files
# first install a db server
# create a connection to your db file
# read the db using pandas

In [8]:
# Anaconda distribution comes with its built-in SQLlite db server
import sqlite3
con = sqlite3.connect('Data\database.db')

In [9]:
# to read the entire db, we need to use a sql query method
df = pd.read_sql_query('select * from purchases', con)
df

    index  apples  oranges
0    June       3        0
1  Robert       2        3
2    Lily       0        7
3   David       1        2

In [10]:
### storing your dataframe
df.to_csv('output_purchases.csv') 
#df.to_json('output_purchases.json')
#df.to_sql('output_purchases', con) # in case of DB, you pass the file name along with the connection attribute

In [16]:
### Knowing your data
# load movies dataset
movies_df = pd.read_csv('Data\movies.csv', index_col='Title')

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [19]:
# view first 5 rows .head()
movies_df.head()
# view first 7 rows
movies_df.head(7)
# view last 5 rows
movies_df.tail()
# view last n rows
movies_df.tail(3)

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [21]:
# get number of rows and cols
movies_df.shape

(1000, 11)

In [46]:
# getting general information: number of rows and cols, number of entries in each column and its type
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 11 columns):
rank           1000 non-null int64
genre          1000 non-null object
description    1000 non-null object
director       1000 non-null object
actors         1000 non-null object
year           1000 non-null int64
runtime_min    1000 non-null int64
rating         1000 non-null float64
votes          1000 non-null int64
revenue        1000 non-null float64
metascore      936 non-null float64
dtypes: float64(3), int64(4), object(4)
memory usage: 133.8+ KB

In [48]:
# get statistical info about each col
movies_df.describe()
# get statistical infor about a single column
movies_df['rank'].describe()

count    1000.000000
mean      500.500000
std       288.819436
min         1.000000
25%       250.750000
50%       500.500000
75%       750.250000
max      1000.000000
Name: rank, dtype: float64

In [25]:
### Cleaning Data
# remove duplicate rows if found
#no_duplicate_movies = movies_df.drop_duplicates()
movies_df.drop_duplicates(inplace=True)

In [26]:
movies_df.shape

(1000, 11)

In [27]:
## working on columns
movies_df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [28]:
# option: change to lowercase
movies_df.columns = [col.lower() for col in movies_df]
movies_df.columns

Index(['rank', 'genre', 'description', 'director', 'actors', 'year',
       'runtime (minutes)', 'rating', 'votes', 'revenue (millions)',
       'metascore'],
      dtype='object')

In [30]:
# option: rename certain columns
movies_df.rename(columns={
    'runtime (minutes)': 'runtime_min',
    'revenue (millions)': 'revenue'
}, inplace=True)
movies_df.columns

Index(['rank', 'genre', 'description', 'director', 'actors', 'year',
       'runtime_min', 'rating', 'votes', 'revenue', 'metascore'],
      dtype='object')

In [31]:
## working with missing values
# when working with data you may see the keyword 'None' or 'nan' 
# you should decide how to deal with these vlaues either by droping or replacing them

In [51]:
# first check whether your data contain null values or not
movies_df.isnull().values.any()

True

In [ ]:
# movies_df.isnull() # return the dataframe with each cell assigned True (contain null) or False(does not contain null)
movies_df.isnull().sum() # notice: only revenue and metascorecolumns have null values

In [36]:
# option 1 drop null: delete the entire row or column
# drop every row with at least one null values
drop_rows_df = movies_df.dropna()
drop_rows_df.shape
#movies_df.shape # does not affect original one

(838, 11)

In [37]:
# delete columns contain null
drop_cols_df = movies_df.dropna(axis=1)
drop_cols_df.shape

(1000, 9)

In [41]:
# option 2 : replacing null values
# if you have a base value for that column, go a head and replace with the base
# if not, you may use the average value as a base
revenue_mean = movies_df['revenue'].mean()
revenue_mean

In [43]:
# replace every null with revenue_mean
movies_df['revenue'].fillna(revenue_mean, inplace=True)

In [44]:
movies_df.revenue

Title
Guardians of the Galaxy                    333.130000
Prometheus                                 126.460000
Split                                      138.120000
Sing                                       270.320000
Suicide Squad                              325.020000
The Great Wall                              45.130000
La La Land                                 151.060000
Mindhorn                                    82.956376
The Lost City of Z                           8.010000
Passengers                                 100.010000
Fantastic Beasts and Where to Find Them    234.020000
Hidden Figures                             169.270000
Rogue One                                  532.170000
Moana                                      248.750000
Colossal                                     2.870000
The Secret Life of Pets                    368.310000
Hacksaw Ridge                               67.120000
Jason Bourne                               162.160000
Lion                                        51.690000
Arrival                                    100.500000
Gold                                         7.220000
Manchester by the Sea                       47.700000
Hounds of Love                              82.956376
Trolls                                     153.690000
Independence Day: Resurgence               103.140000
Paris pieds nus                             82.956376
Bahubali: The Beginning                      6.500000
Dead Awake                                   0.010000
Bad Moms                                   113.080000
Assassin's Creed                            54.650000
                                              ...
Texas Chainsaw 3D                           34.330000
Disturbia                                   80.050000
Rock of Ages                                38.510000
Scream 4                                    38.180000
Queen of Katwe                               8.810000
My Big Fat Greek Wedding 2                  59.570000
Dark Places                                 82.956376
Amateur Night                               82.956376
It's Only the End of the World              82.956376
The Skin I Live In                           3.190000
Miracles from Heaven                        61.690000
Annie                                       85.910000
Across the Universe                         24.340000
Let's Be Cops                               82.390000
Max                                         42.650000
Your Highness                               21.560000
Final Destination 5                         42.580000
Endless Love                                23.390000
Martyrs                                     82.956376
Selma                                       52.070000
Underworld: Rise of the Lycans              45.800000
Taare Zameen Par                             1.200000
Take Me Home Tonight                         6.920000
Resident Evil: Afterlife                    60.130000
Project X                                   54.720000
Secret in Their Eyes                        82.956376
Hostel: Part II                             17.540000
Step Up 2: The Streets                      58.010000
Search Party                                82.956376
Nine Lives                                  19.640000
Name: revenue, Length: 1000, dtype: float64

In [45]:
movies_df.isnull().sum()

rank            0
genre           0
description     0
director        0
actors          0
year            0
runtime_min     0
rating          0
votes           0
revenue         0
metascore      64
dtype: int64